Revit 2027 API
BuiltInFailures.SiteFailures.SurfaceSelfIntersection Property
 The splitting boundary drawn would result in a self-intersection of the surface boundary. Please edit your splitting lines to correct the problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceSelfIntersection { get; }
Public Shared ReadOnly Property SurfaceSelfIntersection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceSelfIntersection {
	FailureDefinitionId^ get ();
}
static member SurfaceSelfIntersection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace